Masmiseim36/nxpSDK/boards/frdmkv11z/project_template/pin_mux.c
/*
 * The Clear BSD License
 * Copyright 2017-2018 NXP
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 *  that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MKV11Z128xxx7
package_id: MKV11Z128VLH7
mcu_data: ksdk2_0
processor_version: 0.0.10
board: FRDM-KV11Z
pin_labels:
- {pin_num: '1', pin_signal: ADC1_SE12/PTE0/UART1_TX, label: TP18}
- {pin_num: '2', pin_signal: ADC1_SE13/PTE1/LLWU_P0/UART1_RX, label: TP19}
- {pin_num: '11', pin_signal: ADC0_SE12/PTE22, label: TP22}
- {pin_num: '12', pin_signal: ADC0_SE13/PTE23, label: TP23}
- {pin_num: '19', pin_signal: ADC0_SE14/CMP0_IN4/PTE31, label: TP24}
- {pin_num: '27', pin_signal: PTA5/FTM0_CH2/FTM5_FLT0, label: TP25}
- {pin_num: '28', pin_signal: PTA12/CAN0_TX/FTM1_CH0/FTM1_QD_PHA, label: TP26}
- {pin_num: '42', pin_signal: PTB19/CAN0_RX/FTM3_CH3, label: TP20}
- {pin_num: '41', pin_signal: PTB18/CAN0_TX/FTM3_CH2, label: TP21}
- {pin_num: '55', pin_signal: ADC1_SE16/PTC10/FTM5_CH0/FTM5_QD_PHA, label: TP17}
- {pin_num: '56', pin_signal: ADC1_SE17/PTC11/LLWU_P11/FTM5_CH1/FTM5_QD_PHB, label: TP16}
- {pin_num: '13', pin_signal: VDDA, label: VDDA}
- {pin_num: '14', pin_signal: VREFH, label: 'J2[16]/AREF/VREFH'}
- {pin_num: '15', pin_signal: VREFL, label: VREFL}
- {pin_num: '16', pin_signal: VSSA, label: VSSA}
- {pin_num: '32', pin_signal: EXTAL0/PTA18/FTM0_FLT2/FTM_CLKIN0/FTM3_CH2, label: 'Y2[1]', identifier: EXTAL}
- {pin_num: '33', pin_signal: XTAL0/PTA19/FTM0_FLT0/FTM1_FLT0/FTM_CLKIN1/LPTMR0_ALT1, label: 'Y2[2]', identifier: XTAL}
- {pin_num: '3', pin_signal: VDD3, label: 'J3[4]/J3[8]/J13[1]/P3V3/P3V3_KV11/VDD'}
- {pin_num: '30', pin_signal: VDD30, label: 'J3[4]/J3[8]/J13[1]/P3V3/P3V3_KV11/VDD'}
- {pin_num: '48', pin_signal: VDD48, label: 'J3[4]/J3[8]/J13[1]/P3V3/P3V3_KV11/VDD'}
- {pin_num: '4', pin_signal: VSS4, label: 'J2[14]/J3[12]/J3[14]/J13[3]/J13[5]/GND/VSS'}
- {pin_num: '31', pin_signal: VSS31, label: 'J2[14]/J3[12]/J3[14]/J13[3]/J13[5]/GND/VSS'}
- {pin_num: '47', pin_signal: VSS47, label: 'J2[14]/J3[12]/J3[14]/J13[3]/J13[5]/GND/VSS'}
- {pin_num: '5', pin_signal: ADC0_SE1/ADC0_DP1/ADC1_SE0/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3, label: 'J4[4]/PTE16'}
- {pin_num: '6', pin_signal: ADC0_DM1/ADC0_SE5/ADC1_SE5/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, label: 'J2[7]/PTE17-ADC0_SE5'}
- {pin_num: '7', pin_signal: ADC0_SE6/ADC1_SE1/ADC1_DP1/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA/SPI0_SIN, label: 'J2[1]/PTE18-ADC0_SE6'}
- {pin_num: '8', pin_signal: ADC0_SE7/ADC1_SE7/ADC1_DM1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/SPI0_SOUT, label: 'J2[5]/PTE19-ADC0_SE7'}
- {pin_num: '9', pin_signal: ADC0_SE0/ADC0_DP0/PTE20/FTM1_CH0/UART0_TX, label: 'J4[6]/ADC0_DP0/THER_A', identifier: ADC0_DP_THER}
- {pin_num: '10', pin_signal: ADC0_SE4/ADC0_DM0/PTE21/FTM1_CH1/UART0_RX, label: 'J4[8]/ADC0_DM0/THER_B', identifier: ADC0_DM_THER}
- {pin_num: '17', pin_signal: CMP1_IN5/CMP0_IN5/PTE29/FTM0_CH2/FTM_CLKIN0, label: 'J1[13]/J1[14]/LD1[4]/PTE29', identifier: LED_GREEN}
- {pin_num: '18', pin_signal: ADC1_SE4/CMP1_IN4/DAC0_OUT/PTE30/FTM0_CH3/FTM_CLKIN1, label: 'J2[9]/PTE30- ADC1_ SE4'}
- {pin_num: '20', pin_signal: PTE24/CAN0_TX/FTM0_CH0/I2C0_SCL/EWM_OUT_b, label: 'J1[1]/J1[8]/U9[1]/PTE24', identifier: CAN_TX}
- {pin_num: '21', pin_signal: PTE25/LLWU_P21/CAN0_RX/FTM0_CH1/I2C0_SDA/EWM_IN, label: 'J1[5]/J1[12]/LD1[3]/U9[4]/PTE25', identifier: LED_BLUE;CAN_RX}
- {pin_num: '22', pin_signal: PTA0/UART0_CTS_b/FTM0_CH5/EWM_IN/SWD_CLK, label: 'J13[4]/U8[4]/SWD_ CLK_ KV11'}
- {pin_num: '23', pin_signal: PTA1/UART0_RX/FTM2_CH0/CMP0_OUT/FTM2_QD_PHA/FTM1_CH1/FTM4_CH0, label: 'J3[3]/PTA1- FRDM- MC- ENC_ A'}
- {pin_num: '24', pin_signal: PTA2/UART0_TX/FTM2_CH1/CMP1_OUT/FTM2_QD_PHB/FTM1_CH0/FTM4_CH1, label: 'J3[1]/PTA2- FRDM- MC- ENC_ B'}
- {pin_num: '25', pin_signal: PTA3/UART0_RTS_b/FTM0_CH0/FTM2_FLT0/EWM_OUT_b/SWD_DIO, label: 'J13[2]/U7[4]/SWD_ DIO_ TGTMCU'}
- {pin_num: '26', pin_signal: PTA4/LLWU_P3/FTM0_CH1/FTM4_FLT0/FTM0_FLT3/NMI_b, label: 'J2[4]/PTA4', identifier: SW3}
- {pin_num: '29', pin_signal: PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/FTM1_QD_PHB, label: 'U9[8]/PTA13', identifier: CAN_S}
- {pin_num: '34', pin_signal: PTA20/RESET_b, label: 'J3[6]/J10[3]/J13[10]/RST_TGTMCU_B'}
- {pin_num: '35', pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX, label: 'J1[10]/J1[11]/PTB0', identifier: SW2}
- {pin_num: '36', pin_signal: ADC0_SE9/ADC1_SE9/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX, label: 'J2[3]/PTB1-ADC0_SE9'}
- {pin_num: '37', pin_signal: ADC0_SE10/ADC1_SE10/ADC1_DM2/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT1/FTM0_FLT3, label: 'J2[15]/J2[20]/J4[12]/U10[9]/PTB2', identifier: ACCEL_INT2}
- {pin_num: '38', pin_signal: ADC1_SE2/ADC1_DP2/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, label: 'J2[11]/J2[18]/J4[10]/U10[11]/PTB3', identifier: ACCEL_INT1}
- {pin_num: '39', pin_signal: PTB16/UART0_RX/FTM_CLKIN2/CAN0_TX/EWM_IN, label: 'J1[6]/U3[4]/UART0_RX_TGTMCU', identifier: DEBUG_UART_RX}
- {pin_num: '40', pin_signal: PTB17/UART0_TX/FTM_CLKIN1/CAN0_RX/EWM_OUT_b, label: 'U5[1]/UART0_TX_TGTMCU', identifier: DEBUG_UART_TX}
- {pin_num: '43', pin_signal: ADC1_SE11/PTC0/SPI0_PCS4/PDB_EXTRG0/CMP0_OUT/FTM0_FLT0/SPI0_PCS0, label: 'J4[2]/PTC0'}
- {pin_num: '44', pin_signal: ADC1_SE3/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FTM2_CH0, label: 'J3[15]/PTC1-FRDM-MC-PWM_AT'}
- {pin_num: '45', pin_signal: ADC0_SE11/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FTM2_CH1, label: 'J3[13]/PTC2-FRDM-MC-PWM_AB'}
- {pin_num: '46', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/FTM3_FLT0, label: 'J3[11]/PTC3-FRDM-MC-PWM_BT'}
- {pin_num: '49', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/CMP1_OUT, label: 'J3[9]/PTC4- FRDM- MC- PWM_ BB'}
- {pin_num: '50', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/CMP0_OUT/FTM0_CH2, label: 'J2[12]/J2[17]/PTC5'}
- {pin_num: '51', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB_EXTRG1/UART0_RX/I2C0_SCL, label: 'J2[8]/J2[13]/U10[4]/I2C0_SCL/SPI0_SOUT/PTC6', identifier: ACCEL_SCL}
- {pin_num: '52', pin_signal: CMP0_IN1/PTC7/SPI0_SIN/UART0_TX/I2C0_SDA, label: 'J1[15]/J1[16]/U10[6]/I2C0_SDA/PTC7', identifier: ACCEL_SDA}
- {pin_num: '53', pin_signal: ADC1_SE14/CMP0_IN2/PTC8/FTM3_CH4, label: 'J4[9]/PTC8'}
- {pin_num: '54', pin_signal: ADC1_SE15/CMP0_IN3/PTC9/FTM3_CH5, label: 'J4[11]/PTC9'}
- {pin_num: '57', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART0_CTS_b/FTM0_CH0/UART1_RX/FTM3_CH0, label: 'J1[2]/J1[7]/J4[1]/PTD0'}
- {pin_num: '58', pin_signal: ADC0_SE2/PTD1/SPI0_SCK/UART0_RTS_b/FTM0_CH1/UART1_TX/FTM3_CH1, label: 'J1[4]/J1[9]/J4[3]/U10[16]/PTD1', identifier: ACCEL_RST}
- {pin_num: '59', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART0_RX/FTM0_CH2/FTM3_CH2/I2C0_SCL, label: 'J2[2]/J4[5]/PTD2'}
- {pin_num: '60', pin_signal: PTD3/SPI0_SIN/UART0_TX/FTM0_CH3/FTM3_CH3/I2C0_SDA, label: 'J2[10]/J2[19]/J4[7]/SPI0_SIN/PTD3'}
- {pin_num: '61', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FTM2_CH0/EWM_IN/SPI0_PCS0, label: 'J3[7]/PTD4- FRDM- MC- PWM_ CT'}
- {pin_num: '62', pin_signal: ADC0_SE3/PTD5/SPI0_PCS2/UART0_CTS_b/FTM0_CH5/FTM2_CH1/EWM_OUT_b/SPI0_SCK, label: 'J3[5]/PTD5- FRDM- MC- PWM_ CB'}
- {pin_num: '63', pin_signal: ADC1_SE6/PTD6/LLWU_P15/FTM4_CH0/UART0_RX/FTM0_CH0/FTM1_CH0/FTM0_FLT0/SPI0_SOUT, label: 'J2[6]/LD1[1]/PTD6', identifier: LED_RED}
- {pin_num: '64', pin_signal: PTD7/FTM4_CH1/UART0_TX/FTM0_CH1/FTM1_CH1/FTM0_FLT1/SPI0_SIN, label: 'J1[3]/PTD7- FRDM- MC- ENC_ I'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

